In [1]:
import pandas as pd

In [39]:
# df = pd.read_csv("Houses-Copy1.csv", header=None)
df = pd.read_csv("Houses-Copy1.csv", names=["Val", "surf", "ter"])
df

       Val  surf    ter
0   212000  4148  25264
1   230000  2501  11891
2   339000  4374  25351
3   289000  2398  22215
4   160000  2536   9234
5    85000  2368  13329
6    85000  1264   8407
7   145000  1572  12588
8   164000  2375  16204
9   123500  1161   9626
10  180000  1542   8755
11  159500  1464  14636
12  156000  2240  21780
13  146500  1269  11250
14  101500   924   7361
15  109800   768  10497
16  182000  1320  15768
17  110000  1845  12153
18  125000  1274  13634
19   80000  1905  10890

In [36]:
t1 = df[df[1]==2536].index.values
t1

array([4], dtype=int64)

In [40]:
df.iat[t1[0], 2]

9234

In [34]:
df[1][2]

4374

In [48]:
df["ter"][5]

13329

In [45]:
df[["surf", "ter"]][2:10]

   surf    ter
2  4374  25351
3  2398  22215
4  2536   9234
5  2368  13329
6  1264   8407
7  1572  12588
8  2375  16204
9  1161   9626

In [54]:
# df["ter"][df["val"]>145000]
# dataframe[dataframe['Percentage'] > 80]
l = df["Val"]>145000
c = "ter"
df.loc[l, c]

0     25264
1     11891
2     25351
3     22215
4      9234
8     16204
10     8755
11    14636
12    21780
13    11250
16    15768
Name: ter, dtype: int64